#### ConnectionValidationInfo Members

---

|  |
| --- |
| ConnectionValidationInfo Class   Constructors   Methods   Properties   See Also |

The  ConnectionValidationInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionValidationInfo | Constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectionValidationInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetWarning | Access specific warning number of warnings generated by reload. |
| Public method | IsValidWarningIndex | Validate warning index. |
| Public method | ManyWarnings | Returns number of warnings generated by reload. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace